luohaojie-tt/FreeRTOS-LEARN/Drivers/PWM/gd32f10x_pwm.c
/**
  ******************************************************************************
  * @file    gd32f10x_pwm.c
  * @author  Auto-generated by Claude Code
  * @version V1.0.0
  * @date    24-August-2025
  * @brief   This file provides all the PWM firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * COPYRIGHT 2025 GIGADEVICE
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "gd32f10x_pwm.h"
#include "gd32f10x_rcc.h"

/** @addtogroup GD32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup PWM 
  * @brief PWM driver modules
  * @{
  */

/** @defgroup PWM_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup PWM_Private_Defines
  * @{
  */

/* ---------------------- PWM registers bit mask ------------------------ */
#define CTL0_CEN_SET          ((uint16_t)0x0001)
#define CTL0_CEN_RESET        ((uint16_t)0x03FE)
#define CCHP_OAEN_SET         ((uint16_t)0x4000)
#define CCHP_OAEN_RESET       ((uint16_t)0x7FFF)

/**
  * @}
  */

/** @defgroup PWM_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup PWM_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup PWM_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup PWM_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the TIMERx peripheral registers to their default reset values.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @retval None
  */
void PWM_DeInit(TIMER_TypeDef* TIMERx)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
 
  if (TIMERx == TIMER0)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIMER0, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIMER0, DISABLE);
  } 
  else if (TIMERx == TIMER1)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER1, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER1, DISABLE);
  }
  else if (TIMERx == TIMER2)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER2, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER2, DISABLE);
  }
  else if (TIMERx == TIMER3)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER3, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER3, DISABLE);
  } 
  else if (TIMERx == TIMER4)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER4, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_TIMER4, DISABLE);
  }
}

/**
  * @brief  Initializes the TIMERx peripheral according to the specified
  *         parameters in the PWM_InitStruct.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_InitStruct: pointer to a PWM_InitTypeDef structure
  *         that contains the configuration information for the specified TIMER peripheral.
  * @retval None
  */
void PWM_Init(TIMER_TypeDef* TIMERx, PWM_InitTypeDef* PWM_InitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;
  uint32_t tmpcnt = 0, tmpdivider = 0, tmpfreq = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx)); 
  assert_param(IS_PWM_CHANNEL(PWM_InitStruct->PWM_Channel));
  assert_param(IS_PWM_COUNTER_MODE(PWM_InitStruct->PWM_CounterMode));
  assert_param(IS_PWM_OC_MODE(PWM_InitStruct->PWM_OCMode));
  assert_param(IS_PWM_OC_POLARITY(PWM_InitStruct->PWM_OCPolarity));
  assert_param(IS_FUNCTIONAL_STATE(PWM_InitStruct->PWM_OutputState));
  assert_param(IS_FUNCTIONAL_STATE(PWM_InitStruct->PWM_OutputNState));
  assert_param(IS_PWM_OUTPUT_IDLE_STATE(PWM_InitStruct->PWM_OCIdleState));
  assert_param(IS_PWM_OUTPUTN_IDLE_STATE(PWM_InitStruct->PWM_OCNIdleState));
  assert_param(IS_PWM_FREQUENCY(PWM_InitStruct->PWM_Frequency));
  assert_param(IS_PWM_DUTYCYCLE(PWM_InitStruct->PWM_DutyCycle));
  
  /* Calculate the prescaler value */
  tmpdivider = SystemCoreClock / 1000000;  /* 1MHz */
  tmpfreq = 1000000 / PWM_InitStruct->PWM_Frequency;
  
  /* Set the Autoreload value */
  TIMERx->CAR = tmpfreq - 1;
  
  /* Set the Prescaler value */
  TIMERx->PSC = tmpdivider - 1;
  
  /* Set the Counter Mode */
  TIMERx->CTL0 &= (uint16_t)(~((uint16_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM)));
  TIMERx->CTL0 |= PWM_InitStruct->PWM_CounterMode;
  
  /* Set the clock division */
  TIMERx->CTL0 &= (uint16_t)(~((uint16_t)TIMER_CTL0_CKDIV));
  TIMERx->CTL0 |= (uint16_t)TIMER_CKD_DIV1;
  
  /* Select the Channel */
  switch (PWM_InitStruct->PWM_Channel)
  {
    case PWM_CHANNEL_0:
      /* Get the TIMERx CHCTLR1 register value */
      tmpccmrx = TIMERx->CHCTLR1;
      /* Reset the Output Compare Mode Bits */
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR1_OC1M));
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR1_CC1S));
      
      /* Select the Output Compare Mode */
      tmpccmrx |= PWM_InitStruct->PWM_OCMode;
      
      /* Reset the Output Polarity level */
      tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH0P));
      /* Set the Output Compare Polarity */
      tmpccer |= PWM_InitStruct->PWM_OCPolarity;
      
      /* Set the Output State */
      if(PWM_InitStruct->PWM_OutputState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH0EN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH0EN));
      }
      
      /* Set the Output N State */
      if(PWM_InitStruct->PWM_OutputNState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH0NEN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH0NEN));
      }
      
      /* Set the Capture Compare Register value */
      tmpcnt = (uint32_t)((tmpfreq * PWM_InitStruct->PWM_DutyCycle) / 100);
      TIMERx->CH0CV = (uint32_t)tmpcnt;
      
