luohaojie-tt/FreeRTOS-LEARN/Drivers/PWM/gd32f10x_pwm.c
      /* Write to TIMERx CHCTLR1 */
      TIMERx->CHCTLR1 = tmpccmrx;
      
      /* Set the Capture Compare Register Preload Bit */
      TIMERx->CHCTLR1 |= (uint16_t)TIMER_CHCTLR1_OC1PE;
      
      /* Write to TIMERx CHCTL2 */
      TIMERx->CHCTL2 = tmpccer;
      
      /* Write to TIMERx CCHP */
      TIMERx->CCHP &= (uint16_t)(~((uint16_t)TIMER_CCHP_OAEN));
      TIMERx->CCHP |= ((uint16_t)PWM_InitStruct->PWM_OCIdleState | (uint16_t)PWM_InitStruct->PWM_OCNIdleState);
      break;
      
    case PWM_CHANNEL_1:
      /* Get the TIMERx CHCTLR1 register value */
      tmpccmrx = TIMERx->CHCTLR1;
      /* Reset the Output Compare Mode Bits */
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR1_OC2M));
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR1_CC2S));
      
      /* Select the Output Compare Mode */
      tmpccmrx |= (uint16_t)(PWM_InitStruct->PWM_OCMode << 8);
      
      /* Reset the Output Polarity level */
      tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH1P));
      /* Set the Output Compare Polarity */
      tmpccer |= (uint16_t)(PWM_InitStruct->PWM_OCPolarity << 4);
      
      /* Set the Output State */
      if(PWM_InitStruct->PWM_OutputState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH1EN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH1EN));
      }
      
      /* Set the Output N State */
      if(PWM_InitStruct->PWM_OutputNState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH1NEN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH1NEN));
      }
      
      /* Set the Capture Compare Register value */
      tmpcnt = (uint32_t)((tmpfreq * PWM_InitStruct->PWM_DutyCycle) / 100);
      TIMERx->CH1CV = (uint32_t)tmpcnt;
      
      /* Write to TIMERx CHCTLR1 */
      TIMERx->CHCTLR1 = tmpccmrx;
      
      /* Set the Capture Compare Register Preload Bit */
      TIMERx->CHCTLR1 |= (uint16_t)TIMER_CHCTLR1_OC2PE;
      
      /* Write to TIMERx CHCTL2 */
      TIMERx->CHCTL2 = tmpccer;
      
      /* Write to TIMERx CCHP */
      TIMERx->CCHP &= (uint16_t)(~((uint16_t)TIMER_CCHP_OAEN));
      TIMERx->CCHP |= ((uint16_t)PWM_InitStruct->PWM_OCIdleState | (uint16_t)PWM_InitStruct->PWM_OCNIdleState);
      break;
      
    case PWM_CHANNEL_2:
      /* Get the TIMERx CHCTLR2 register value */
      tmpccmrx = TIMERx->CHCTLR2;
      /* Reset the Output Compare Mode Bits */
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR2_OC3M));
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR2_CC3S));
      
      /* Select the Output Compare Mode */
      tmpccmrx |= PWM_InitStruct->PWM_OCMode;
      
      /* Reset the Output Polarity level */
      tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH2P));
      /* Set the Output Compare Polarity */
      tmpccer |= (uint16_t)(PWM_InitStruct->PWM_OCPolarity << 8);
      
      /* Set the Output State */
      if(PWM_InitStruct->PWM_OutputState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH2EN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH2EN));
      }
      
      /* Set the Output N State */
      if(PWM_InitStruct->PWM_OutputNState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH2NEN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH2NEN));
      }
      
      /* Set the Capture Compare Register value */
      tmpcnt = (uint32_t)((tmpfreq * PWM_InitStruct->PWM_DutyCycle) / 100);
      TIMERx->CH2CV = (uint32_t)tmpcnt;
      
      /* Write to TIMERx CHCTLR2 */
      TIMERx->CHCTLR2 = tmpccmrx;
      
      /* Set the Capture Compare Register Preload Bit */
      TIMERx->CHCTLR2 |= (uint16_t)TIMER_CHCTLR2_OC3PE;
      
      /* Write to TIMERx CHCTL2 */
      TIMERx->CHCTL2 = tmpccer;
      
      /* Write to TIMERx CCHP */
      TIMERx->CCHP &= (uint16_t)(~((uint16_t)TIMER_CCHP_OAEN));
      TIMERx->CCHP |= ((uint16_t)PWM_InitStruct->PWM_OCIdleState | (uint16_t)PWM_InitStruct->PWM_OCNIdleState);
      break;
      
    case PWM_CHANNEL_3:
      /* Get the TIMERx CHCTLR2 register value */
      tmpccmrx = TIMERx->CHCTLR2;
      /* Reset the Output Compare Mode Bits */
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR2_OC4M));
      tmpccmrx &= (uint16_t)(~((uint16_t)TIMER_CHCTLR2_CC4S));
      
      /* Select the Output Compare Mode */
      tmpccmrx |= (uint16_t)(PWM_InitStruct->PWM_OCMode << 8);
      
      /* Reset the Output Polarity level */
      tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH3P));
      /* Set the Output Compare Polarity */
      tmpccer |= (uint16_t)(PWM_InitStruct->PWM_OCPolarity << 12);
      
      /* Set the Output State */
      if(PWM_InitStruct->PWM_OutputState == ENABLE)
      {
        tmpccer |= (uint16_t)TIMER_CHCTL2_CH3EN;
      }
      else
      {
        tmpccer &= (uint16_t)(~((uint16_t)TIMER_CHCTL2_CH3EN));
      }
      
      /* Set the Capture Compare Register value */
      tmpcnt = (uint32_t)((tmpfreq * PWM_InitStruct->PWM_DutyCycle) / 100);
      TIMERx->CH3CV = (uint32_t)tmpcnt;
      
      /* Write to TIMERx CHCTLR2 */
      TIMERx->CHCTLR2 = tmpccmrx;
      
      /* Set the Capture Compare Register Preload Bit */
      TIMERx->CHCTLR2 |= (uint16_t)TIMER_CHCTLR2_OC4PE;
      
      /* Write to TIMERx CHCTL2 */
      TIMERx->CHCTL2 = tmpccer;
      break;
      
    default:
      break;
  }
  
  /* Set the Main Output Enable bit */
  if((TIMERx == TIMER0) || (TIMERx == TIMER1) || (TIMERx == TIMER2))
  {
    TIMERx->CCHP |= CCHP_OAEN_SET;
  }
}

/**
  * @brief  Fills each PWM_InitStruct member with its default value.
  * @param  PWM_InitStruct : pointer to a PWM_InitTypeDef structure which will be initialized.
  * @retval None
  */
void PWM_StructInit(PWM_InitTypeDef* PWM_InitStruct)
{
  /* Set the default configuration */
  PWM_InitStruct->PWM_Channel = PWM_CHANNEL_0;
  PWM_InitStruct->PWM_Frequency = 1000;  /* 1KHz */
  PWM_InitStruct->PWM_DutyCycle = 50;     /* 50% */
  PWM_InitStruct->PWM_CounterMode = PWM_COUNTERMODE_UP;
  PWM_InitStruct->PWM_OCMode = PWM_OCMODE_PWM1;
  PWM_InitStruct->PWM_OCPolarity = PWM_OCPOLARITY_HIGH;
  PWM_InitStruct->PWM_OutputState = ENABLE;
  PWM_InitStruct->PWM_OutputNState = DISABLE;
  PWM_InitStruct->PWM_Pulse = 0x0000;
  PWM_InitStruct->PWM_OCNIdleState = PWM_OCNIDLESTATE_RESET;
  PWM_InitStruct->PWM_OCIdleState = PWM_OCIDLESTATE_RESET;
}

/**
  * @brief  Enables or disables the specified TIMER peripheral.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  NewState: new state of the TIMERx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void PWM_Cmd(TIMER_TypeDef* TIMERx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the TIMER Counter */
    TIMERx->CTL0 |= CTL0_CEN_SET;
  }
  else
  {
    /* Disable the TIMER Counter */
    TIMERx->CTL0 &= CTL0_CEN_RESET;
  }
}

/**
  * @brief  Enables or disables the TIMER peripheral Main Outputs.
  * @param  TIMERx: where x can be 0, 1, 2 to select the TIMER peripheral.
  * @param  NewState: new state of the TIMER peripheral Main Outputs.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void PWM_CtrlPWMOutput(TIMER_TypeDef* TIMERx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the TIMER Main Output */
    TIMERx->CCHP |= CCHP_OAEN_SET;
  }
  else
  {
    /* Disable the TIMER Main Output */
    TIMERx->CCHP &= CCHP_OAEN_RESET;
  }
}

/**
  * @brief  Configures the TIMERx Output Compare 1 Fast feature.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCFast_Enable: TIM Output Compare Fast enable
  *     @arg PWM_OCFast_Disable: TIM Output Compare Fast disable
  * @retval None
  */
void PWM_OC1FastConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCFast)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCFAST_STATE(PWM_OCFast));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC1FE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC1FE);
  
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr1 |= PWM_OCFast;
  
