luohaojie-tt/FreeRTOS-LEARN/Drivers/PWM/gd32f10x_pwm.c
  /* Write to TIMERx CHCTLR1 */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Configures the TIMERx Output Compare 2 Fast feature.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCFast_Enable: TIM Output Compare Fast enable
  *     @arg PWM_OCFast_Disable: TIM Output Compare Fast disable
  * @retval None
  */
void PWM_OC2FastConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCFast)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCFAST_STATE(PWM_OCFast));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC2FE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC2FE);
  
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr1 |= (uint16_t)(PWM_OCFast << 8);
  
  /* Write to TIMERx CHCTLR1 */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Configures the TIMERx Output Compare 3 Fast feature.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCFast_Enable: TIM Output Compare Fast enable
  *     @arg PWM_OCFast_Disable: TIM Output Compare Fast disable
  * @retval None
  */
void PWM_OC3FastConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCFast)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCFAST_STATE(PWM_OCFast));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC3FE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC3FE);
  
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr2 |= PWM_OCFast;
  
  /* Write to TIMERx CHCTLR2 */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Configures the TIMERx Output Compare 4 Fast feature.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCFast_Enable: TIM Output Compare Fast enable
  *     @arg PWM_OCFast_Disable: TIM Output Compare Fast disable
  * @retval None
  */
void PWM_OC4FastConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCFast)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCFAST_STATE(PWM_OCFast));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC4FE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC4FE);
  
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr2 |= (uint16_t)(PWM_OCFast << 8);
  
  /* Write to TIMERx CHCTLR2 */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Sets the TIMERx Capture Compare1 Register value
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  Compare1: specifies the Capture Compare1 register new value.
  * @retval None
  */
void PWM_SetCompare1(TIMER_TypeDef* TIMERx, uint32_t Compare1)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  
  /* Set the Capture Compare1 Register value */
  TIMERx->CH0CV = Compare1;
}

/**
  * @brief  Sets the TIMERx Capture Compare2 Register value
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  Compare2: specifies the Capture Compare2 register new value.
  * @retval None
  */
void PWM_SetCompare2(TIMER_TypeDef* TIMERx, uint32_t Compare2)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  
  /* Set the Capture Compare2 Register value */
  TIMERx->CH1CV = Compare2;
}

/**
  * @brief  Sets the TIMERx Capture Compare3 Register value
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  Compare3: specifies the Capture Compare3 register new value.
  * @retval None
  */
void PWM_SetCompare3(TIMER_TypeDef* TIMERx, uint32_t Compare3)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  
  /* Set the Capture Compare3 Register value */
  TIMERx->CH2CV = Compare3;
}

/**
  * @brief  Sets the TIMERx Capture Compare4 Register value
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  Compare4: specifies the Capture Compare4 register new value.
  * @retval None
  */
void PWM_SetCompare4(TIMER_TypeDef* TIMERx, uint32_t Compare4)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  
  /* Set the Capture Compare4 Register value */
  TIMERx->CH3CV = Compare4;
}

/**
  * @brief  Sets the TIMERx Auto Reload Register value
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  Autoreload: specifies the Auto Reload register new value.
  * @retval None
  */
void PWM_SetAutoreload(TIMER_TypeDef* TIMERx, uint32_t Autoreload)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  
  /* Set the Autoreload Register value */
  TIMERx->CAR = Autoreload;
}

/**
  * @brief  Sets the TIMERx Prescaler Register value
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  Prescaler: specifies the Prescaler register new value.
  * @retval None
  */
void PWM_SetPrescaler(TIMER_TypeDef* TIMERx, uint16_t Prescaler)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  
  /* Set the Prescaler value */
  TIMERx->PSC = Prescaler;
}

/**
  * @brief  Forces the TIMERx output 1 waveform to active or inactive level.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg PWM_ForcedAction_Active: Force active level on OC1REF
  *     @arg PWM_ForcedAction_InActive: Force inactive level on OC1REF.
  * @retval None
  */
void PWM_ForcedOC1Config(TIMER_TypeDef* TIMERx, uint16_t PWM_ForcedAction)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_FORCED_ACTION(PWM_ForcedAction));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC1M Bits */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC1M);
  
