luohaojie-tt/FreeRTOS-LEARN/Drivers/PWM/gd32f10x_pwm.c
  /* Configure The Forced output Mode */
  tmpccmr1 |= PWM_ForcedAction;
  
  /* Write to TIMERx CHCTLR1 register */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Forces the TIMERx output 2 waveform to active or inactive level.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg PWM_ForcedAction_Active: Force active level on OC2REF
  *     @arg PWM_ForcedAction_InActive: Force inactive level on OC2REF.
  * @retval None
  */
void PWM_ForcedOC2Config(TIMER_TypeDef* TIMERx, uint16_t PWM_ForcedAction)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_FORCED_ACTION(PWM_ForcedAction));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC2M Bits */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC2M);
  
  /* Configure The Forced output Mode */
  tmpccmr1 |= (uint16_t)(PWM_ForcedAction << 8);
  
  /* Write to TIMERx CHCTLR1 register */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Forces the TIMERx output 3 waveform to active or inactive level.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg PWM_ForcedAction_Active: Force active level on OC3REF
  *     @arg PWM_ForcedAction_InActive: Force inactive level on OC3REF.
  * @retval None
  */
void PWM_ForcedOC3Config(TIMER_TypeDef* TIMERx, uint16_t PWM_ForcedAction)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_FORCED_ACTION(PWM_ForcedAction));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC3M Bits */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC3M);
  
  /* Configure The Forced output Mode */
  tmpccmr2 |= PWM_ForcedAction;
  
  /* Write to TIMERx CHCTLR2 register */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Forces the TIMERx output 4 waveform to active or inactive level.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg PWM_ForcedAction_Active: Force active level on OC4REF
  *     @arg PWM_ForcedAction_InActive: Force inactive level on OC4REF.
  * @retval None
  */
void PWM_ForcedOC4Config(TIMER_TypeDef* TIMERx, uint16_t PWM_ForcedAction)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_FORCED_ACTION(PWM_ForcedAction));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC4M Bits */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC4M);
  
  /* Configure The Forced output Mode */
  tmpccmr2 |= (uint16_t)(PWM_ForcedAction << 8);
  
  /* Write to TIMERx CHCTLR2 register */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Enables or disables the TIMERx peripheral Preload register on CCR1.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCPreload: new state of the TIMERx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg PWM_OCPreload_Enable
  *     @arg PWM_OCPreload_Disable
  * @retval None
  */
void PWM_OC1PreloadConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCPreload)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCPRELOAD_STATE(PWM_OCPreload));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC1PE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC1PE);
  
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr1 |= PWM_OCPreload;
  
  /* Write to TIMERx CHCTLR1 register */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Enables or disables the TIMERx peripheral Preload register on CCR2.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCPreload: new state of the TIMERx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg PWM_OCPreload_Enable
  *     @arg PWM_OCPreload_Disable
  * @retval None
  */
void PWM_OC2PreloadConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCPreload)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCPRELOAD_STATE(PWM_OCPreload));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC2PE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC2PE);
  
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr1 |= (uint16_t)(PWM_OCPreload << 8);
  
  /* Write to TIMERx CHCTLR1 register */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Enables or disables the TIMERx peripheral Preload register on CCR3.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCPreload: new state of the TIMERx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg PWM_OCPreload_Enable
  *     @arg PWM_OCPreload_Disable
  * @retval None
  */
void PWM_OC3PreloadConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCPreload)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCPRELOAD_STATE(PWM_OCPreload));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC3PE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC3PE);
  
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr2 |= PWM_OCPreload;
  
  /* Write to TIMERx CHCTLR2 register */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Enables or disables the TIMERx peripheral Preload register on CCR4.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCPreload: new state of the TIMERx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg PWM_OCPreload_Enable
  *     @arg PWM_OCPreload_Disable
  * @retval None
  */
void PWM_OC4PreloadConfig(TIMER_TypeDef* TIMERx, uint16_t PWM_OCPreload)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCPRELOAD_STATE(PWM_OCPreload));
  
