luohaojie-tt/FreeRTOS-LEARN/Drivers/PWM/gd32f10x_pwm.c
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC4PE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC4PE);
  
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr2 |= (uint16_t)(PWM_OCPreload << 8);
  
  /* Write to TIMERx CHCTLR2 register */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Configures the TIMERx Output Compare 1 Clear Bit.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCClear_Enable: TIM Output clear enable
  *     @arg PWM_OCClear_Disable: TIM Output clear disable
  * @retval None
  */
void PWM_ClearOC1Ref(TIMER_TypeDef* TIMERx, uint16_t PWM_OCClear)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCCLEAR_STATE(PWM_OCClear));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC1CE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC1CE);
  
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr1 |= PWM_OCClear;
  
  /* Write to TIMERx CHCTLR1 register */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Configures the TIMERx Output Compare 2 Clear Bit.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCClear_Enable: TIM Output clear enable
  *     @arg PWM_OCClear_Disable: TIM Output clear disable
  * @retval None
  */
void PWM_ClearOC2Ref(TIMER_TypeDef* TIMERx, uint16_t PWM_OCClear)
{
  uint16_t tmpccmr1 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCCLEAR_STATE(PWM_OCClear));
  
  tmpccmr1 = TIMERx->CHCTLR1;
  
  /* Reset the OC2CE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TIMER_CHCTLR1_OC2CE);
  
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr1 |= (uint16_t)(PWM_OCClear << 8);
  
  /* Write to TIMERx CHCTLR1 register */
  TIMERx->CHCTLR1 = tmpccmr1;
}

/**
  * @brief  Configures the TIMERx Output Compare 3 Clear Bit.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCClear_Enable: TIM Output clear enable
  *     @arg PWM_OCClear_Disable: TIM Output clear disable
  * @retval None
  */
void PWM_ClearOC3Ref(TIMER_TypeDef* TIMERx, uint16_t PWM_OCClear)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCCLEAR_STATE(PWM_OCClear));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC3CE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC3CE);
  
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr2 |= PWM_OCClear;
  
  /* Write to TIMERx CHCTLR2 register */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Configures the TIMERx Output Compare 4 Clear Bit.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg PWM_OCClear_Enable: TIM Output clear enable
  *     @arg PWM_OCClear_Disable: TIM Output clear disable
  * @retval None
  */
void PWM_ClearOC4Ref(TIMER_TypeDef* TIMERx, uint16_t PWM_OCClear)
{
  uint16_t tmpccmr2 = 0;
  
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_OCCLEAR_STATE(PWM_OCClear));
  
  tmpccmr2 = TIMERx->CHCTLR2;
  
  /* Reset the OC4CE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TIMER_CHCTLR2_OC4CE);
  
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr2 |= (uint16_t)(PWM_OCClear << 8);
  
  /* Write to TIMERx CHCTLR2 register */
  TIMERx->CHCTLR2 = tmpccmr2;
}

/**
  * @brief  Selects the TIMERx peripheral Capture Compare DMA source.
  * @param  TIMERx: where x can be 0, 1, 2, 3 or 4 to select the TIMER peripheral.
  * @param  PWM_CCADMA: specifies the Capture Compare DMA source.
  *   This parameter can be one of the following values:
  *     @arg PWM_CCADMA_Enable: CCx DMA request sent when capture or compare match occurs
  *     @arg PWM_CCADMA_Disable: CCx DMA requests are disabled
  * @retval None
  */
void PWM_CCADMACmd(TIMER_TypeDef* TIMERx, uint16_t PWM_CCADMA)
{
  /* Check the parameters */
  assert_param(IS_PWM_ALL_PERIPH(TIMERx));
  assert_param(IS_PWM_CCADMA_STATE(PWM_CCADMA));
  
  if(PWM_CCADMA == PWM_CCADMA_Enable)
  {
    /* Set the CCDS Bit */
    TIMERx->CTL0 |= TIMER_CCADMA_Enable;
  }
  else
  {
    /* Reset the CCDS Bit */
    TIMERx->CTL0 &= (uint16_t)~((uint16_t)TIMER_CCADMA_Enable);
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT 2025 GIGADEVICE *****END OF FILE****/